Бухгалтерские_задачи_Финиш/src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПродажиТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Счета</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Бухгалтерские_задачи_Финиш/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Счета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.ПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Счета.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Счета.ExtDimensionAccountingFlag._Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаМСФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_Финиш/src/Enums/ВидыОперацийПродажиТоваров/ВидыОперацийПродажиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПродажиТоваров</name>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСХранения</name>
  </enumValues>
</mdclass:Enum>

Бухгалтерские_задачи_Финиш/src/ChartsOfAccounts/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Счета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары опт</description>
        <code>41.1</code>
      </childItems>
      <childItems>
        <name>ТоварыРозница</name>
        <description>Товары розница</description>
        <code>41.2</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>СчетВБанке</name>
      <description>Счет в банке</description>
      <code>51</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПокупателямОтгрузили</name>
        <description>Покупателям отгрузили</description>
        <code>62.1</code>
      </childItems>
      <childItems>
        <name>АвансОтПокупателей</name>
        <description>Аванс от покупателей</description>
        <code>62.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ЗарплатаСотрудников</name>
      <description>Зарплата сотрудников</description>
      <code>70</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасходыДоходы</name>
      <description>Расходы доходы</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ХранениеТоваров</name>
      <description>Хранение товаров</description>
      <code>001</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>ЭтоГруппа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>ПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>_Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_Финиш/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.ЗначенияПользовательскихСубконто</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.ДвиженияДенежныхСредств</types>
    <types>CatalogRef.Договоры</types>
    <types>DocumentRef.ПеремещениеТоваров</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Склады</types>
    <types>DocumentRef.ПоступлениеТоваров</types>
    <types>DocumentRef.РучнаяОперация</types>
  </type>
  <predefined>
    <items>
      <name>ДвиженияДенежныхСредств</name>
      <description>Движения денежных средств</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.ДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Партия</name>
      <description>Партия</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.ПоступлениеТоваров</types>
        <types>DocumentRef.РучнаяОперация</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Бухгалтерские_задачи_Финиш/src/Documents/ПродажаТоваров/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПолучитьФункциональнуюОпцию("УчетПоПодразделениям"
		, Новый Структура("ПФО_Организация", Организация)) = Ложь Тогда
	
		  Индекс = ПроверяемыеРеквизиты.Найти("Подразделение");
			ПроверяемыеРеквизиты.Удалить(Индекс);
			
	
	КонецЕсли;                      
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если ВидОперации = Перечисления.ВидыОперацийПродажиТоваров.Продажа Тогда
	
		ПродажаТовара(Отказ, Режим);
		
	Иначе
		
		ВозвратТовараВладельцу(Отказ, Режим);
	
	КонецЕсли;
	
	
	Если Отказ = Ложь Тогда
		
		Движения.Проводки.Записывать = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПродажаТовара(Отказ, Режим)
	
	//В учебных целях (для упрощения) делаем допущение, что складской учет ведется.
	
	
	//--БЛОКИРОВКА
	#Область Блокировка
	
	Блокировка = Новый БлокировкаДанных;
	
	ЧтоБлокируем = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
	ЧтоБлокируем.Режим = РежимБлокировкиДанных.Исключительный;   //Можно не писать. Этот режим работает "по умолчанию".
	
	ЧтоБлокируем.УстановитьЗначение("Организация", Организация);
	ЧтоБлокируем.УстановитьЗначение("Подразделение", Подразделение);
	
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить("СправочникСсылка.Номенклатура");
	МассивТипов.Добавить("СправочникСсылка.Склады");
	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.Счета"));
	ТЗ.Колонки.Добавить("Субконто_1",Новый ОписаниеТипов(МассивТипов));
	ТЗ.Колонки.Добавить("Субконто_2",Новый ОписаниеТипов(МассивТипов));
	
	
	Для каждого ТекСтрока Из Товары Цикл
		
		НоваяСтрокаТЗ = ТЗ.Добавить();
		НоваяСтрокаТЗ.Счет = ТекСтрока.СчетУчета;
		
		Если ТекСтрока.СчетУчета.ВидыСубконто.Получить(0).ВидСубконто 
			= ПланыВидовХарактеристик.ВидыСубконто.Номенклатура Тогда
			
			НоваяСтрокаТЗ.Субконто_1 = ТекСтрока.Номенклатура;
			НоваяСтрокаТЗ.Субконто_2 = Склад;
			
		Иначе
			
			НоваяСтрокаТЗ.Субконто_1 = Склад;
			НоваяСтрокаТЗ.Субконто_2 = ТекСтрока.Номенклатура;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтоБлокируем.ИсточникДанных = ТЗ;
	ЧтоБлокируем.ИспользоватьИзИсточникаДанных("Счет","Счет");
	ЧтоБлокируем.ИспользоватьИзИсточникаДанных("Субконто1","Субконто_1");
	ЧтоБлокируем.ИспользоватьИзИсточникаДанных("Субконто2","Субконто_2");
	
	
	Блокировка.Заблокировать();
	
	#КонецОбласти 	
	
	//--ОЧИСТКА ДВИЖЕНИЙ ЭТОГО ДОКУМЕНТА В БАЗЕ ДАННЫХ
	
	Движения.Проводки.Записывать = Истина;
	Движения.Записать();
	
	// ---  ЗАПРОС
	
	
	ПорядокСубконто = Новый Массив;
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склады);
	
	
	Запрос = Новый Запрос;
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	Запрос.УстановитьПараметр("ПорядокСубконто", ПорядокСубконто);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Запрос.Текст = "ВЫБРАТЬ
|	ПродажаТоваровТовары.СчетУчета КАК СчетУчета,
|	ПродажаТоваровТовары.Номенклатура КАК Номенклатура,
|	СУММА(ПродажаТоваровТовары.Количество) КАК Количество,
|	СУММА(ПродажаТоваровТовары.Сумма) КАК Сумма
|ПОМЕСТИТЬ ВТТМЦДокумента
|ИЗ
|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
|ГДЕ
|	ПродажаТоваровТовары.Ссылка = &Ссылка
|
|СГРУППИРОВАТЬ ПО
|	ПродажаТоваровТовары.СчетУчета,
|	ПродажаТоваровТовары.Номенклатура
|
|ИНДЕКСИРОВАТЬ ПО
|	СчетУчета,
|	Номенклатура
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ПроводкиОстатки.Счет КАК Счет,
|	ПроводкиОстатки.Субконто1 КАК Субконто1,
|	ПроводкиОстатки.СуммаОстатокДт,
|	ПроводкиОстатки.КоличествоОстатокДт
|ПОМЕСТИТЬ ВТОстаткиВсе
|ИЗ
|	РегистрБухгалтерии.Проводки.Остатки(
|			&Период,
|			Счет В
|				(ВЫБРАТЬ
|					ВТТМЦДокумента.СчетУчета
|				ИЗ
|					ВТТМЦДокумента КАК ВТТМЦДокумента),
|			&ПорядокСубконто,
|			Организация = &Организация
|				И Подразделение = &Подразделение
|				И Субконто1 В
|					(ВЫБРАТЬ
|						ВТТМЦДокумента.Номенклатура
|					ИЗ
|						ВТТМЦДокумента КАК ВТТМЦДокумента)) КАК ПроводкиОстатки
|
|ИНДЕКСИРОВАТЬ ПО
|	Счет,
|	Субконто1
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ПроводкиОстатки.Счет КАК Счет,
|	ПроводкиОстатки.Субконто1 КАК Субконто1,
|	ПроводкиОстатки.КоличествоОстатокДт
|ПОМЕСТИТЬ ВТОстаткиСклад
|ИЗ
|	РегистрБухгалтерии.Проводки.Остатки(
|			&Период,
|			Счет В
|				(ВЫБРАТЬ
|					ВТТМЦДокумента.СчетУчета
|				ИЗ
|					ВТТМЦДокумента КАК ВТТМЦДокумента),
|			&ПорядокСубконто,
|			Организация = &Организация
|				И Подразделение = &Подразделение
|				И Субконто1 В
|					(ВЫБРАТЬ
|						ВТТМЦДокумента.Номенклатура
|					ИЗ
|						ВТТМЦДокумента КАК ВТТМЦДокумента)
|				И Субконто2 = &Склад) КАК ПроводкиОстатки
|
|ИНДЕКСИРОВАТЬ ПО
|	Счет,
|	Субконто1
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТТМЦДокумента.СчетУчета,
|	ВТТМЦДокумента.Номенклатура,
|	ВТТМЦДокумента.Количество,
|	ВТТМЦДокумента.Сумма,
|	ЕСТЬNULL(ВТОстаткиСклад.КоличествоОстатокДт, 0) КАК КоличествоОстатокДт,
|	ВЫБОР
|		КОГДА ВТОстаткиВсе.КоличествоОстатокДт ЕСТЬ NULL
|			ТОГДА 0
|		КОГДА ВТОстаткиВсе.КоличествоОстатокДт = 0
|			ТОГДА 0
|		КОГДА ВТОстаткиВсе.КоличествоОстатокДт = ВТТМЦДокумента.Количество
|			ТОГДА ВТОстаткиВсе.СуммаОстатокДт
|		ИНАЧЕ ВТОстаткиВсе.СуммаОстатокДт / ВТОстаткиВсе.КоличествоОстатокДт * ВТТМЦДокумента.Количество
|	КОНЕЦ КАК Себестоимость
|ИЗ
|	ВТТМЦДокумента КАК ВТТМЦДокумента
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиВсе КАК ВТОстаткиВсе
|		ПО ВТТМЦДокумента.СчетУчета = ВТОстаткиВсе.Счет
|			И ВТТМЦДокумента.Номенклатура = ВТОстаткиВсе.Субконто1
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиСклад КАК ВТОстаткиСклад
|		ПО ВТТМЦДокумента.СчетУчета = ВТОстаткиСклад.Счет
|			И ВТТМЦДокумента.Номенклатура = ВТОстаткиСклад.Субконто1";
	
	
	Результат = Запрос.Выполнить();
	
	//--ВЫБОРКА ИЗ РЕЗУЛЬТАТА ЗАПРОСА
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//--ПРОВЕРКА НАЛИЧИЯ УЧТЕННОГО ТМЦ ПО СЧЕТУ НА СКЛАДЕ
		
		Нехватка = Выборка.Количество - Выборка.КоличествоОстатокДт;
		
		Если Нехватка > 0 Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = "Для проведения по данным бухгалтерского учета по счету "
			+ Выборка.СчетУчета + " не хватает номенклатуры """
			+ Выборка.Номенклатура + """. Нехватка составляет " + Нехватка + " ед.";
			
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
		//--Формируем движения в регистре бухгелтрии
		
		Если Отказ = Ложь Тогда
			
			//=========================================================================
			//-- ПРОВОДКА = ДЕБЕТ (90) РАСХОДЫ -  КРЕДИТ СЧЕТ УЧЕТА ТМЦ (10, 41.1, 41.2) - СУММА СЕБЕСТОИМОСТИ 
			
			Движение = Движения.Проводки.Добавить();
			
			Движение.Период = Дата;
			Движение.СодержаниеПроводки = "Себестоимость продажи";
			Движение.Организация = Организация;
			Движение.Сумма = Выборка.Себестоимость;
			
			
			Движение.СчетДт = ПланыСчетов.Счета.РасходыДоходы;
			Серверный.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Дт");
			
			
			
			Движение.СчетКт = Выборка.СчетУчета;
			
			Серверный.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Кт");
			Серверный.ЗаполнитьКоличествоСтороныПроводки(Движение, Выборка.Количество, "Кт");
			
			Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение, "Номенклатура", Выборка.Номенклатура, "Кт");
			Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение, "Склады", Склад, "Кт");
			Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение, "Контрагенты", Контрагент, "Кт");
			
			
			//=========================================================================
			//-- ПРОВОДКА = ДЕБЕТ (62.1) РАСЧЕТЫ С ПОКУПАТЕЛЕМ - ТМЦ КРЕДИТ (90) ДОХОДЫ
			
			
			Движение = Движения.Проводки.Добавить();
			
			Движение.Период = Дата;
			Движение.СодержаниеПроводки = "Выручка от продажи";
			Движение.Организация = Организация;
			Движение.Сумма = Выборка.Сумма; 
			
			Движение.СчетДт = ПланыСчетов.Счета.ПокупателямОтгрузили;
			
			Серверный.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Дт");
			
			Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение, "Контрагенты", Контрагент, "Дт");
			Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение, "Договоры", Договор, "Дт");
			
			Серверный.ЗаполнитьВалютуСтороныПроводки(Движение,Валюта,Выборка.Сумма,"Дт");
			
			Движение.СчетКт = ПланыСчетов.Счета.РасходыДоходы;
			
			Серверный.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Кт");
			
			//? Может пригодиться
			Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение, "Номенклатура", Выборка.Номенклатура, "Кт");
			
			
		КонецЕсли; 
		
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ВозвратТовараВладельцу(Отказ, Режим)

	//Контрольная работа...
	
КонецПроцедуры
